{"config": [{"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "activation": "relu", "batch_input_shape": [null, 1, 28, 28], "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "dtype": "float32", "bias_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [2, 2], "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "filters": 128}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "pool_size": [3, 3], "strides": [3, 3], "padding": "valid", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [2, 2], "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "filters": 128}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [2, 2], "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "filters": 128}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "pool_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 256, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 256, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_3", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}